## software_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`
**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!
```terraform
Plan: 4 to add, 4 to change, 5 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.dependencytrack_api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dependencytrack_api_policies"  {
      ~ id      = "4260308972" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_url"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "elasticfilesystem:DescribeMountTargets",
                          - "elasticfilesystem:ClientWrite",
                          - "elasticfilesystem:ClientMount",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:elasticfilesystem:ca-central-1:794722365809:file-system/fs-00d2fbd255781e5ec"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              + "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_password",
              - "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_url",
              + "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_user",
            ]
            # (2 unchanged attributes hidden)
        }
      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.template_file.dependencytrack_api_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "dependencytrack_api_container_definition"  {
      ~ id       = "af756b195f249fe8a46117fcdac32ee9f3e94cac274edb226baef12109f04467" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - cpu              = 4096
                  - environment      = [
                      - {
                          - name  = "ALPINE_DATABASE_MODE"
                          - value = "external"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_DRIVER"
                          - value = "org.postgresql.Driver"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_DRIVER_PATH"
                          - value = "/extlib/postgresql-42.2.5.jar"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_POOL_ENABLED"
                          - value = "false"
                        },
                      - {
                          - name  = "ALPINE_CORS_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "ALPINE_CORS_ALLOW_ORIGIN"
                          - value = "*"
                        },
                      - {
                          - name  = "ALPINE_CORS_ALLOW_METHODS"
                          - value = "GET, POST, PUT, DELETE, OPTIONS"
                        },
                      - {
                          - name  = "ALPINE_CORS_ALLOW_HEADERS"
                          - value = "Origin, Content-Type, Authorization, X-Requested-With, Content-Length, Accept, Origin, X-Api-Key, X-Total-Count, *"
                        },
                      - {
                          - name  = "ALPINE_CORS_ALLOW_CREDENTIALS"
                          - value = "true"
                        },
                      - {
                          - name  = "ALPINE_CORS_MAX_AGE"
                          - value = "3600"
                        },
                    ]
                  - essential        = true
                  - image            = "dependencytrack/apiserver:4.5.0@sha256:9365f306ac54eaf1216ad8f2846062b3fe538399d8fb10a11e82be20c8c8e797"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/dependencytrack_api"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "dependencytrack_api-task"
                        }
                    }
                  - mountPoints      = [
                      - {
                          - containerPath = "/data"
                          - readOnly      = false
                          - sourceVolume  = "dependencytrack_api"
                        },
                    ]
                  - name             = "dependencytrack_api"
                  - portMappings     = [
                      - {
                          - ContainerPort = 8080
                          - Protocol      = "tcp"
                          - hostPort      = 8080
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "ALPINE_DATABASE_URL"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_url"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ template = <<-EOT
            [
              {
                "name" : "${DEPENDENCYTRACK_SERVICE_NAME}",
                "cpu" : 4096,
                "environment" : [
                  {
                    "name" : "ALPINE_DATABASE_MODE",
                    "value" : "external"
                  },
                  {
          +         "name" : "ALPINE_DATABASE_URL,
          +         "value" : "${ALPINE_DATABASE_URL}"
          +       },
          +       {
                    "name" : "ALPINE_DATABASE_DRIVER",
                    "value" : "org.postgresql.Driver"
                  },
                  {
                    "name" : "ALPINE_DATABASE_DRIVER_PATH",
                    "value" : "/extlib/postgresql-42.2.5.jar"
                  },
                  {
                    "name" : "ALPINE_DATABASE_POOL_ENABLED",
                    "value" : "false"
                  },
                  {
                    "name" : "ALPINE_CORS_ENABLED",
                    "value" : "true"
                  },
                  {
                    "name" : "ALPINE_CORS_ALLOW_ORIGIN",
                    "value" : "*"
                  },
                  {
                    "name" : "ALPINE_CORS_ALLOW_METHODS",
                    "value" : "GET, POST, PUT, DELETE, OPTIONS"
                  },
                  {
                    "name" : "ALPINE_CORS_ALLOW_HEADERS",
                    "value" : "Origin, Content-Type, Authorization, X-Requested-With, Content-Length, Accept, Origin, X-Api-Key, X-Total-Count, *"
                  },
                  {
                    "name" : "ALPINE_CORS_ALLOW_CREDENTIALS",
                    "value" : "true"
                  },
                  {
                    "name" : "ALPINE_CORS_MAX_AGE",
                    "value" : "3600"
                  }
                ],
                "essential" : true,
                "image" : "${DEPENDENCYTRACK_API_IMAGE}",
                "mountPoints" : [
                  {
                    "sourceVolume" : "${DEPENDENCYTRACK_SERVICE_NAME}",
                    "containerPath" : "/data",
                    "readOnly" : false
                  }
                ],
                "logConfiguration" : {
                  "logDriver" : "awslogs",
                  "options" : {
                    "awslogs-group": "${AWS_LOGS_GROUP}",
                    "awslogs-region": "${AWS_LOGS_REGION}",
                    "awslogs-stream-prefix": "${AWS_LOGS_STREAM_PREFIX}"
                  }
                },
                "portMappings" : [
                  {
                    "hostPort" : 8080,
                    "ContainerPort" : 8080,
                    "Protocol" : "tcp"
                  }
                ],
                "secrets" : [
                  {
          -         "name" : "ALPINE_DATABASE_URL",
          -         "valueFrom" : "${ALPINE_DATABASE_URL}"
          +         "name" : "ALPINE_DATABASE_USERNAME",
          +         "valueFrom" : "${ALPINE_DATABASE_USERNAME}"
          +       },
          +       {
          +         "name" : "ALPINE_DATABASE_PASSWORD",
          +         "valueFrom" : "${ALPINE_DATABASE_PASSWORD}"
                  }
                ]
              }
            ]
        EOT
      ~ vars     = {
          + "ALPINE_DATABASE_PASSWORD"     = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_password"
          ~ "ALPINE_DATABASE_URL"          = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_url" -> "jdbc:postgresql://dependency-track-proxy.proxy-cjgksqbmhiov.ca-central-1.rds.amazonaws.com:5432/dtrack"
          + "ALPINE_DATABASE_USERNAME"     = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_user"
            # (5 unchanged elements hidden)
        }
    }

  # aws_ecs_service.dependencytrack_api will be updated in-place
  ~ resource "aws_ecs_service" "dependencytrack_api" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/software_asset_tracking/dependencytrack_api"
        name                               = "dependencytrack_api"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-software-asset-inventory"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/dependencytrack_api:14" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.dependencytrack_api must be replaced
-/+ resource "aws_ecs_task_definition" "dependencytrack_api" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/dependencytrack_api:14" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 4096
                  - environment      = [
                      - {
                          - name  = "ALPINE_CORS_ALLOW_CREDENTIALS"
                          - value = "true"
                        },
                      - {
                          - name  = "ALPINE_CORS_ALLOW_HEADERS"
                          - value = "Origin, Content-Type, Authorization, X-Requested-With, Content-Length, Accept, Origin, X-Api-Key, X-Total-Count, *"
                        },
                      - {
                          - name  = "ALPINE_CORS_ALLOW_METHODS"
                          - value = "GET, POST, PUT, DELETE, OPTIONS"
                        },
                      - {
                          - name  = "ALPINE_CORS_ALLOW_ORIGIN"
                          - value = "*"
                        },
                      - {
                          - name  = "ALPINE_CORS_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "ALPINE_CORS_MAX_AGE"
                          - value = "3600"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_DRIVER"
                          - value = "org.postgresql.Driver"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_DRIVER_PATH"
                          - value = "/extlib/postgresql-42.2.5.jar"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_MODE"
                          - value = "external"
                        },
                      - {
                          - name  = "ALPINE_DATABASE_POOL_ENABLED"
                          - value = "false"
                        },
                    ]
                  - essential        = true
                  - image            = "dependencytrack/apiserver:4.5.0@sha256:9365f306ac54eaf1216ad8f2846062b3fe538399d8fb10a11e82be20c8c8e797"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/dependencytrack_api"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "dependencytrack_api-task"
                        }
                    }
                  - mountPoints      = [
                      - {
                          - containerPath = "/data"
                          - readOnly      = false
                          - sourceVolume  = "dependencytrack_api"
                        },
                    ]
                  - name             = "dependencytrack_api"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "ALPINE_DATABASE_URL"
                          - valueFrom = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_url"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "dependencytrack_api" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-software-asset-inventory"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

      - volume {
          - name = "dependencytrack_api" -> null

          - efs_volume_configuration {
              - file_system_id          = "fs-00d2fbd255781e5ec" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 0 -> null

              - authorization_config {
                  - access_point_id = "fsap-097132859e0c22c68" -> null
                  - iam             = "DISABLED" -> null
                }
            }
        }
      + volume {
          + name = "dependencytrack_api"

          + efs_volume_configuration {
              + file_system_id     = "fs-00d2fbd255781e5ec"
              + root_directory     = "/"
              + transit_encryption = "ENABLED"

              + authorization_config {
                  + access_point_id = "fsap-097132859e0c22c68"
                  + iam             = "DISABLED"
                }
            }
        }
    }

  # aws_iam_policy.dependencytrack_api_policies will be updated in-place
  ~ resource "aws_iam_policy" "dependencytrack_api_policies" {
        id        = "arn:aws:iam::794722365809:policy/DependencytrackAPIContainerExecutionPolicies"
        name      = "DependencytrackAPIContainerExecutionPolicies"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:DescribeParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_url"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "elasticfilesystem:DescribeMountTargets",
                          - "elasticfilesystem:ClientWrite",
                          - "elasticfilesystem:ClientMount",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:elasticfilesystem:ca-central-1:794722365809:file-system/fs-00d2fbd255781e5ec"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-software-asset-inventory"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_ssm_parameter.dependencytrack_db_password will be updated in-place
  ~ resource "aws_ssm_parameter" "dependencytrack_db_password" {
        id              = "/dependencytrack/dependencytrack_db_password"
      + insecure_value  = (known after apply)
        name            = "/dependencytrack/dependencytrack_db_password"
        tags            = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-software-asset-inventory"
            "Terraform"  = "true"
        }
      ~ value           = (sensitive value)
      ~ version         = 8 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_ssm_parameter.dependencytrack_db_url will be destroyed
  # (because aws_ssm_parameter.dependencytrack_db_url is not in configuration)
  - resource "aws_ssm_parameter" "dependencytrack_db_url" {
      - allowed_pattern = "" -> null
      - arn             = "arn:aws:ssm:ca-central-1:794722365809:parameter/dependencytrack/dependencytrack_db_url" -> null
      - data_type       = "text" -> null
      - description     = "" -> null
      - id              = "/dependencytrack/dependencytrack_db_url" -> null
      - key_id          = "alias/aws/ssm" -> null
      - name            = "/dependencytrack/dependencytrack_db_url" -> null
      - tags            = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-software-asset-inventory"
          - "Terraform"  = "true"
        } -> null
      - tags_all        = {
          - "CostCentre" = "security-tools-794722365809"
          - "Product"    = "security-tools-software-asset-inventory"
          - "Terraform"  = "true"
        } -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value)
      - version         = 5 -> null
    }

  # random_password.dependencytrack_db_password["2022-10"] must be replaced
-/+ resource "random_password" "dependencytrack_db_password" {
      ~ bcrypt_hash = (sensitive value)
      ~ id          = "none" -> (known after apply)
      ~ length      = 30 -> 32 # forces replacement
      ~ result      = (sensitive value)
        # (9 unchanged attributes hidden)
    }

  # module.dependencytrack_db.aws_rds_cluster.cluster will be updated in-place
  ~ resource "aws_rds_cluster" "cluster" {
        id                                  = "dependency-track-cluster"
      ~ master_password                     = (sensitive value)
        tags                                = {
            "CostCentre" = "security-tools-794722365809"
            "Name"       = "dependency-track-cluster"
            "Terraform"  = "true"
        }
        # (43 unchanged attributes hidden)
    }

  # module.dependencytrack_db.aws_secretsmanager_secret_version.connection_string must be replaced
-/+ resource "aws_secretsmanager_secret_version" "connection_string" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:794722365809:secret:dependency-track-vhjwtm-iS90d1" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:794722365809:secret:dependency-track-vhjwtm-iS90d1|59AEE95D-8426-4310-A1B9-1DF4B472A679" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "59AEE95D-8426-4310-A1B9-1DF4B472A679" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.dependencytrack_db.aws_secretsmanager_secret_version.proxy_connection_string must be replaced
-/+ resource "aws_secretsmanager_secret_version" "proxy_connection_string" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:794722365809:secret:dependency-track-vhjwtm-proxy-connection-string-YGauyY" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:794722365809:secret:dependency-track-vhjwtm-proxy-connection-string-YGauyY|E9E34DEC-4F74-4BE2-83FA-6C793B265BE7" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "E9E34DEC-4F74-4BE2-83FA-6C793B265BE7" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 4 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
